Австралия/src/Catalogs/FinancialReportsItems/FinancialReportsItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FinancialReportsItems</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.FinancialReportsTypes</owners>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>EnumRef.FinancialReportItemsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrinting</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReverseSign</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalFilter</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>HasSettings</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AnalyticsValue</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>LinkedItem</name>
    <type>
      <types>CatalogRef.FinancialReportsItems</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemTypeAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FormulaOperands</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operand</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TableItems</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Column</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFields</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputTitle</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InSeparateColumn</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItems</name>
    <attributes>
      <name>Appearance</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceAppliedAreaType</name>
      <type>
        <types>EnumRef.AppearanceAppliedAreasTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedRows</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedColumns</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItemsFilterFieldsDetails</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterFieldName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ResourceName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ValuesSources</name>
    <attributes>
      <name>Source</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AddedDocumentValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/FinancialReportItemsTypes/FinancialReportItemsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FinancialReportItemsTypes</name>
  <enumValues>
    <name>ReportTitle</name>
  </enumValues>
  <enumValues>
    <name>NonEditableText</name>
  </enumValues>
  <enumValues>
    <name>EditableText</name>
  </enumValues>
  <enumValues>
    <name>AccountingDataIndicator</name>
  </enumValues>
  <enumValues>
    <name>UserDefinedFixedIndicator</name>
  </enumValues>
  <enumValues>
    <name>BudgetItem</name>
  </enumValues>
  <enumValues>
    <name>BudgetItemsAll</name>
  </enumValues>
  <enumValues>
    <name>BudgetIndicator</name>
  </enumValues>
  <enumValues>
    <name>BudgetIndicatorsAll</name>
  </enumValues>
  <enumValues>
    <name>UserDefinedCalculatedIndicator</name>
  </enumValues>
  <enumValues>
    <name>NonfinancialIndicator</name>
  </enumValues>
  <enumValues>
    <name>EditableValue</name>
  </enumValues>
  <enumValues>
    <name>TableIndicatorsInRows</name>
  </enumValues>
  <enumValues>
    <name>TableIndicatorsInColumns</name>
  </enumValues>
  <enumValues>
    <name>TableComplex</name>
  </enumValues>
  <enumValues>
    <name>TableItem</name>
  </enumValues>
  <enumValues>
    <name>Columns</name>
  </enumValues>
  <enumValues>
    <name>Rows</name>
  </enumValues>
  <enumValues>
    <name>ConfigureCells</name>
  </enumValues>
  <enumValues>
    <name>TableCell</name>
  </enumValues>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Group</name>
  </enumValues>
  <enumValues>
    <name>GroupTotal</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/FinancialReportsItems/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	Description = "" + ItemType + ": " + DescriptionForPrinting + ", ";
	For Each AdditionalAttribute In ItemTypeAttributes Do
		If Not ValueIsFilled(AdditionalAttribute.Value) Then
			Continue;
		EndIf;
		Description = Description + AdditionalAttribute.Value + ", ";
	EndDo;
	
	Description = Left(Description, StrLen(Description) - 2);
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If ItemType = Enums.FinancialReportItemsTypes.Group Then
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "DescriptionForPrinting");
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
